#include <stdio.h>//введення бібліотек
int main() {
    int x;
    int product = 1; // початкове значення добутку непарних чисел
    printf("Введіть ціле число x: ");
    scanf("%d", &x);
    for (int i = 11; i <= 59; i += 2) {
        if (i < x) {
            product *= i;//якщо умова виконується, то множимо потечне значення
        }//задаємо цикл з параметром
    }
    printf("Добуток всіх непарних чисел менших за %d у діапазоні [10;60]: %d\n", x, product);//виведення функції
    return 0;
}
