#include <stdio.h>
#include <math.h>//введення бібліотек

int main() {
int a, b, y;
double x; //оголошуємо змінні
do {
printf("Введіть ціле число a: ");
scanf("%d", &a);
printf("Введіть ціле число b: ");
scanf("%d", &b);
if (a*b<0){
printf("Помилка, тому що, добуток a і b  має бути додатнім або рівним нулю. Будь ласка введіть інше значення. \n" );
}//умова при якій необчислюється вираз
if (a>b*b) {
printf("Помилка, тому що, під коренем не може бути від'ємного значення. Будь ласка введіть інше значення. \n");
}//умова при якій необчислюється вираз
printf("введіть ціле число y: ");
scanf("%d", &y);
x = sqrt(a-b*b) + sqrt(a*b) + y/2.0;
printf("Значення функції: %1.1f\n", x);//виведення функції
}//do-ключова конструкція циклу, в якій виконуються дія
 while(1);//перевіряється умова
return 0;
 }
